Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: An occurrence of textual content found during the analysis of a block of text, such as when matching a regular expression.
ja: あるテキストの塊の分析の間に、例えばある正規表現のマッチングの時に、見つけられたテキスト内容の存在。

source: An opaque value derived from an anchor source and a particular view.
ja: アンカーソースおよび特定のビューから引き出されるある不透明値。

source: An option indicating that the system is using increased contrast between the app's foreground and background colors.
ja: システムがアプリのもつ前景と背景色の間で増大コントラストを使っていることを指し示すオプション。

source: An option indicating that the system is using standard contrast between the app's foreground and background colors.
ja: システムがアプリのもつ前景と背景色の間で標準コントラストを使っていることを指し示すオプション。

source: An option set.
ja: あるオプションセット。

source: An optional value.
ja: オプショナル値。

source: An unwrapped value.
ja: アンラップされた値。

source: Animatable Implementations
ja: アニメーション化可能な実装

source: Animating Views and Transitions
ja: ビューと遷移をアニメーション化する

source: Animation
ja: アニメーション

source: Another valid index of the collection.
ja: コレクションの別の有効なインデックス。

source: Another value to compare.
ja: もう一方の比較する値。

source: Any attempt to add a XMLDocument node, XMLDTD node, namespace node, or attribute node as a child raises an exception.
ja: XMLDocumentノード、 XMLDTDノード、名前空間ノード、または属性ノードを子として加えるどんな試みも、例外を引き起こします。

source: Any key on the numeric keypad.
ja: 数値キーパッド上の何らかのキー。

source: Any non-nil minimum, ideal, or maximum parameters specified for each dimension must be in ascending order.
ja: 各次元に指定されたあらゆる非nilの最小限、最適、または最大限パラメータは、昇順でなければなりません。

source: Any other node must be a XMLNode object representing a comment or a processing instruction.
ja: なんらかの他のノードは、あるXMLNodeオブジェクトで、あるコメントまたは処理命令を表していなければなりません、

source: App Structure and Behavior
ja: アプリの構造と挙動

source: AppKit Hosting
ja: AppKitをホストする

source: Appends a copy of path to the path.
ja: パスのコピーをこのパスに追加します。

source: Appends a straight line segment from the current point to the specified point.
ja: ある直線分を現在の点からこの指定された点まで追加します。

source: Applies a Gaussian blur to the view.
ja: ガウスぼかしをビューに適用します。

source: Applies a Gaussian blur to this view.
ja: ガウシアンぼかしをこのビューに適用します。

source: Applies a bold font weight to the text.
ja: ボールドフォントウェイトをテキストに適用します。

source: Applies a hue rotation effect to the view.
ja: 色相回転効果をビューに適用します。

source: Applies a hue rotation effect to this view.
ja: 色相回転効果をこのビューに適用します。

source: Applies a modifier to a view.
ja: 修飾子をビューに適用します。

source: Applies a projection transformation to this view’s rendered output.
ja: 投影変換をこのビューのもつ描画された出力に適用します。

source: Applies a strikethrough to the text.
ja: 取り消し線をテキストに適用します。

source: Applies a transaction to the bound value when it changes.
ja: あるトランザクションを、バインドされた値へと、それが変化する時に適用します。

source: Applies an affine transform to this shape.
ja: アフィン変換をこの形状に適用します。

source: Applies an affine transformation to this view’s rendered output.
ja: アフィン変換をこのビューのもつ描画された出力に適用します。

source: Applies an animation to the bound value when it changes.
ja: あるアニメーションを、バインドされた値へと、それが変化する時に適用します。

source: Applies an underline to the text.
ja: 下線をテキストに適用します。

source: Applies italics to the text.
ja: イタリック体をテキストに適用します。

source: Applies the XSLT pattern rules and templates (specified as a data object) to the receiver and returns a document object containing transformed XML or HTML markup.
ja: XSLTパターン規則とテンプレート（データオブジェクトとして指定される）をレシーバに適用します、そして変換されたXMLまたはHTMLマークアップを含むある書類オブジェクトを返します。

source: Applies the XSLT pattern rules and templates (specified as a string) to the receiver and returns a document object containing transformed XML or HTML markup.
ja: XSLTパターン規則とテンプレート（文字列として指定される）をレシーバに適用します、そして変換されたXMLまたはHTMLマークアップを含むある書類オブジェクトを返します。

source: Applies the XSLT pattern rules and templates located at a specified URL to the receiver and returns a document object containing transformed XML markup or an NSData object containing plain text, RTF text, and so on.
ja: 指定されたURLで位置するXSLTパターン規則とテンプレートをレシーバに適用します、そして変換されたXMLマークアップを含むある書類オブジェクトまたはプレーンテキスト、RTFテキスト、などを含むNSDataオブジェクトを返します。

source: Applies the given animation to all animatable values within the view.
ja: 与えられたアニメーションをビュー内の全てのアニメーション可能な値に適用します。

source: Applies the given animation to all animatable values within this view.
ja: 与えられたアニメーションをこのビュー内の全てのアニメーション可能ビューに適用します。

source: Applies the given animation to the view when the specified value changes.
ja: 与えられたアニメーションをビューに適用します、指定された値が変化する時に。

source: Applies the given animation to this view when the specified value changes.
ja: 与えられたアニメーションをこのビューに適用します、この指定された値が変化する場合に。

source: Applies the given transaction mutation function to all transactions used within the view.
ja: 与えられたトランザクション変異関数をビュー内で使われるすべてのトランザクションに適用します。

source: Apply contrast to a view to increase or decrease the separation between similar colors in the view.
ja: コントラストをビューに適用して、そのビューにおける同系色間の分離を漸増または漸減してください。

source: Apply contrast to a view when you want to increase or decrease the separation between similar colors in the view.
ja: あなたがビューにおいて同系色間の分離を漸増または漸減したい場合に、コントラストをビューに適用してください。

source: Apply opacity to reveal views that are behind another view or to de-emphasize a view.
ja: 不透明性を適用することで、別のビューの後ろにあるビューを見えるようにまたはビューを強調除去してください。

source: Apply powerful modifiers to built-in views and your own views to customize their rendering and interactivity.
ja: パワフルな修飾子を、組み込みビューおよびあなた独自のビューに適用して、それらの描出と相互作用性をカスタマイズしてください。

source: Apply styles from environment-aware colors to rich gradients to the foreground, background, and outline of your shapes.
ja: 環境認知色から豊かな勾配までのさまざまなスタイルをあなたの形状の前面、背面、そして輪郭に適用してください。

source: Applying Animations
ja: アニメーションを適用する

source: Applying Color Schemes
ja: カラースキームを適用する

source: Applying Custom Button Styles
ja: あつらえのボタンスタイルを適用する

source: Applying Graphical Effects to a View
ja: グラフィカル効果をビューに適用する

source: Applying Standard Button Styles
ja: 標準ボタンスタイルを適用する

source: Applying Standard Modifiers
ja: 標準修飾子を適用する

source: Applying Transactions
ja: トランザクションを適用する

source: Applying negative contrast values, as shown in the -20% square, will apply contrast in addition to inverting colors.
ja: 負のコントラスト値を適用することは、-20%正方形で示されるように、コントラストに加えて色を逆にすることを適用するでしょう。

source: Applying the onDrag(_:) modifier adds the appropriate gestures for drag and drop to this view.
ja: onDrag(_:)修飾子を適用することは、ドラッグ＆ドロップに適切なジェスチャをこのビューに加えます。

source: Applying the $ prefix to a property wrapped value returns its projectedValue, which for a state property wrapper returns a binding to the value.
ja: $接頭辞をプロパティラップ値に適用することは、それのprojectedValueを返します、それはある状態プロパティラッパーに対して、その値へのバインディングを返します。

source: Architectural Views
ja: 建築上のビュー

source: Archives and Serialization
ja: アーカイブとシリアライゼーション

source: As an example, temporary edit mode may be engaged over the duration of a swipe gesture.
ja: １つの例として、一時的編集モードは、あるスワイプジェスチャ期間を越えて関係しているかもしれません。

source: As the gesture recognizer’s closure registers events inside circle it stores them in the shared location state variable and the VStack displays the coordinates in a Text view.
ja: ジェスチャリコグナイザ（ジェスチャ認識子）のもつクロージャがcircle内部のイベントそれらを登録するにつれて、それはそれらを共有location状態変数の中に格納します、そしてVStackは座標をTextビューにおいて表示します。

source: As you build this primary navigation, you’ll explore how composed views can adapt to different device sizes and orientations.
ja: あなたがこの主ナビゲーションをビルドするとき、あなたは、構成されたビューが異なるデバイスサイズおよび方向にどのように順応するか探査するでしょう。

source: Assemble the view’s body by combining one or more of the primitive views provided by SwiftUI, like the Text instance in the example above, plus other custom views that you define, into a hierarchy of views.
ja: ビューのもつボディの組み立てを、SwiftUIによって提供される１つ以上のプリミティブビューを、上の例でのTextインスタンスのように、それに加えてあなたが定義する他のあつらえのビューを、ビューそれらからなるある階層へと結合することによって行ってください。

source: Assigns a name to the view’s coordinate space, so other code can operate on dimensions like points and sizes relative to the named space.
ja: ある名前をビューのもつ座標空間に対して割り当てます、それで他のコードは、その名前空間に関連する点と大きさのような次元それらで演算できます

source: Assigns a name to this view’s coordinate space to which descendants of this view can refer.
ja: ある名前をこのビューのもつ座標空間に割り当てます、それに対してこのビューの子孫が参照可能です。

source: Associated Type
ja: 関連型

source: Associated Types
ja: 関連型

source: Associates a transition with the view.
ja: ある遷移をビューと結びつけます。

source: At creation time, specify the SwiftUI view you want to use as the root view for this view controller; you can change that view later using the rootView property.
ja: 作成時に、あなたがこのビューコントローラに対するルートビューとして使いたいSwiftUIビューを指定してください；あなたはそのビューを後でrootViewプロパティを使って変更できます。

source: At each step in the loop, the contrast(_:) modifier changes the contrast of the circle/square view in 20% increments.
ja: ループの各段階で、contrast(_:)修飾子は、円／正方形ビューのコントラストを20%増えたものに変えます。

source: At least one of the sequences must be finite.
ja: 少なくともシーケンスのうちの一方は有限でなければなりません。

source: Attaches a context menu and its children to the view.
ja: あるコンテキストメニューおよびそれの子らをビューに添付します。

source: Attaches a contextual menu and its children to the view.
ja: あるコンテキストによるメニューとそれの子をビューに添付します。

source: Attaches a contextual menu to the view.
ja: あるコンテキストによるメニューをビューに添付します。

source: Attaches a gesture to the view to process simultaneously with gestures defined by the view.
ja: ジェスチャをビューに添付します、ビューによって定義されるジェスチャと同期的に処理することになります。

source: Attaches a gesture to the view with a higher precedence than gestures defined by the view.
ja: ジェスチャをビューに添付します、ビューによって定義されるジェスチャより高い優先度で。

source: Attaches a gesture to the view with a lower precedence than gestures defined by the view.
ja: ジェスチャをビューに添付します、ビューによって定義されるジェスチャより低い優先度で。

source: Attaches an animation to this transition.
ja: アニメーションをこの遷移に添付します。

source: Attachment Anchors
ja: 添付物固定点

source: Attempting to access an element by using an index outside the bounds of the slice’s indices may result in a runtime error, even if that index is valid for the original collection.
ja: ある要素にスライスのもつインデックスの境界外のインデックスを使ってアクセスを試みることは、実行時エラーという結果になるでしょう、たとえそのインデックスが元々のコレクションに対して有効であるとしてもです。

source: Attempting to remove the same shipping option a second time results in nil, because options no longer contains .priority as a member.
ja: 同じ出荷オプションの除去を２回目に試みることはnilという結果になります、optionsはもはや.priorityをメンバとして含まないからです。

source: Attempts to create a binding by projecting the base optional value to its unwrapped value.
ja: 基本オプショナル値をそれのアンラップされた値に対して見積もることによって、バインディングを作成します。

source: Availability
ja: 有効性

source: Available when AnimatableData is EmptyAnimatableData.
ja: AnimatableDataがEmptyAnimatableDataである時に利用可能です。

source: Available when ArrayLiteralElement is Self.Element.
ja: ArrayLiteralElementがSelf.Elementである時に利用可能です。

source: Available when Body is Never.
ja: BodyがNeverである時に利用可能です。

source: Available when Data conforms to RandomAccessCollection, ID conforms to Hashable, and Content conforms to View.
ja: DataがRandomAccessCollectionに準拠する、IDがHashableに準拠する、そしてContentがViewに準拠する時に利用可能です。

source: Available when Data conforms to RandomAccessCollection, ID is Data.Element.ID, Content conforms to View, and Data.Element conforms to Identifiable.
ja: DataがRandomAccessCollectionに準拠する、IDがData.Element.IDである、ContentがViewに準拠する、そしてData.ElementがIdentifiableに準拠する場合に利用可能です。

source: Available when Data is Range<Int>, ID is Int, and Content conforms to View.
ja: DataがRange<Int>である、IDがIntである、そしてContentがViewに準拠する場合に利用可能です。

source: Available when Document conforms to FileDocument and Content conforms to View.
ja: DocumentがFileDocumentに準拠する、そしてContentがViewに準拠する場合に利用可能です。

source: Available when Document conforms to ReferenceFileDocument and Content conforms to View.
ja: DocumentがReferenceFileDocumentに準拠する、そしてContentがViewに準拠する場合に利用可能です。

source: Available when Element conforms to Comparable.
ja: ElementがComparableに準拠する時に利用可能です。

source: Available when Element conforms to Equatable.
ja: ElementがEquatableに準拠する時に利用可能です。

source: Available when Element conforms to StringProtocol.
ja: ElementがStringProtocolに準拠する時に利用可能です。

source: Available when Element is (CGRect, NSColor).
ja: Elementが(CGRect, NSColor)である時に利用可能です。

source: Available when Element is (CGRect, gray: CGFloat).
ja: Elementが(CGRect, gray: CGFloat)である時に利用可能です。

source: Available when Element is NSRect.
ja: ElementがNSRectである時に利用可能です。

source: Available when Element is String.
ja: ElementがStringである時に利用可能です。

source: Available when First conforms to Gesture, Second conforms to Gesture, First.Value conforms to Equatable, and Second.Value conforms to Equatable.
ja: FirstがGestureに準拠する、SecondがGesture準拠する、First.ValueがEquatableに準拠する、そしてSecond.ValueがEquatableに準拠する時に準拠します。

source: Available when Index conforms to Strideable, Indices is Range<Self.Index>, and Index.Stride is Int.
ja: IndexがStrideableに準拠する、IndicesがRange<Self.Index>である、そしてIndex.StrideがIntである時に利用可能です。

source: Available when Iterator is IndexingIterator<Self>.
ja: IteratorがIndexingIterator<Self>である時に利用可能です。

source: Available when Label conforms to View.
ja: LabelがViewに準拠する場合に利用可能です。

source: Available when Label is PrimitiveButtonStyleConfiguration.Label.
ja: LabelがPrimitiveButtonStyleConfiguration.Labelである時に利用可能です。

source: Available when Label is Text and Content conforms to View.
ja: LabelがTextであるそしてContentがViewに準拠する場合に利用可能です。

source: Available when Label is Text.
ja: LabelがTextである時に利用可能です。

source: Available when RawValue conforms to FixedWidthInteger.
ja: RawValueがFixedWidthIntegerに準拠する時に利用可能です。

source: Available when Result inherits NSManagedObject.
ja: ResultがNSManagedObjectを継承する場合に利用可能です。

source: Available when Self conforms to Equatable.
ja: SelfがEquatableに準拠する場合に利用可能です。

source: Available when Self conforms to Hashable and RawValue conforms to Hashable.
ja: SelfがHashableに準拠するそしてRawValueがHashableに準拠する時に利用可能です。

source: Available when Self conforms to VectorArithmetic.
ja: SelfがVectorArithmeticに準拠する時に利用可能です。

source: Available when Self conforms to View and Body is _ShapeView<Rectangle, Self>.
ja: SelfがViewに準拠するそしてBodyが_ShapeView<Rectangle, Self>である時に利用可能です。

source: Available when Self is Self.Element.
ja: SelfがSelf.Elementである時に利用可能です。

source: Available when SubSequence is Slice<Self>.
ja: SubSequenceがSlice<Self>である時に利用可能です。

source: Available when Value conforms to Equatable.
ja: ValueがEquatableに準拠する時に利用可能です。

source: Available when Value conforms to ExpressibleByNilLiteral.
ja: ValueがExpressibleByNilLiteralに準拠する場合に利用可能です。

source: Available when Value is CGPoint.
ja: ValueがCGPointである場合に利用可能。

source: Available when Value is CGRect.
ja: ValueがCGRectである場合に利用可能。

source: Available when Content conforms to DynamicViewContent and Modifier conforms to ViewModifier.
ja: ContentがDynamicViewContentに準拠するそしてModifierがViewModifierに準拠する時に利用可能です。

source: Available when Content conforms to Equatable and Modifier conforms to Equatable.
ja: ContentがEquatableに準拠するそしてModifierがEquatableに準拠する時に利用可能です。

source: Available when Content conforms to InsettableShape.
ja: ContentがInsettableShapeに準拠する場合に利用可能です。

source: Available when Content conforms to View and Modifier conforms to ViewModifier.
ja: ContentがViewに準拠するそしてModifierがViewModifierに準拠する時に利用可能です。

source: Available when Content conforms to View.
ja: ContentがViewに準拠する場合に利用可能です。

source: Available when Coordinator is Void.
ja: CoordinatorがVoidである時に利用可能です。

source: Available when Destination is _WKStoryboardContent.
ja: Destinationが_WKStoryboardContentである時に利用可能です。

source: Available when Element conforms to Sequence.
ja: ElementがSequenceに準拠する時に利用可能です。

source: Available when First conforms to Gesture, Second conforms to Gesture, First.Value conforms to Hashable, and Second.Value conforms to Hashable.
ja: FirstがGestureに準拠する、SecondがGestureに準拠する、First.ValueがHashableに準拠する、そしてSecond.ValueがHashableに準拠する時に利用可能です。

source: Available when ID is Data.Element.ID, Content conforms to View, and Data.Element conforms to Identifiable.
ja: IDがData.Element.IDである、ContentがViewに準拠する、そしてData.ElementがIdentifiableに準拠する場合に利用可能です。

source: Available when Label is EmptyView and ValueLabel is EmptyView.
ja: LabelがEmptyViewであるそしてValueLabelがEmptyViewである時に利用可能です。

source: Available when Label is EmptyView.
ja: LabelがEmptyViewである時に利用可能です。

source: Available when Label is ToggleStyleConfiguration.Label.
ja: LabelがToggleStyleConfiguration.Labelである時に利用可能です。

source: Available when Modifier is AccessibilityAttachmentModifier.
ja: ModifierがAccessibilityAttachmentModifierである時に利用可能です。

source: Available when Parent conforms to View, Content conforms to View, and Footer conforms to View.
ja: ParentがViewに準拠する、ContentがViewに準拠する、そしてFooterがViewに準拠する時に利用可能です。

source: Available when Parent conforms to View, Content conforms to View, and Footer is EmptyView.
ja: ParentがViewに準拠する、ContentがViewに準拠する、そしてFooterがEmptyViewである時に利用可能です。

source: Available when Parent is EmptyView, Content conforms to View, and Footer conforms to View.
ja: ParentがEmptyViewである、ContentがViewに準拠する、そしてFooterがViewに準拠する時に利用可能です。

source: Available when Parent is EmptyView, Content conforms to View, and Footer is EmptyView.
ja: ParentがEmptyViewである、ContentがViewに準拠する、そしてFooterがEmptyViewである時に利用可能です。

source: Available when Result conforms to NSManagedObject.
ja: ResultがNSManagedObjectに準拠する場合に利用可能です。

source: Available when SelectionValue is Int.
ja: SelectionValueがIntである時に利用可能です。

source: Available when SelectionValue is Never.
ja: SelectionValueがNeverである時に利用可能です。

source: Available when ValueLabel is EmptyView.
ja: ValueLabelがEmptyViewである時に利用可能です。

source: Avoid performing long-running tasks on the main thread.
ja: 長く動作するタスクをメインスレッド上で実行することを避けてください。

source: Basic Gestures
ja: 基本ジェスチャ

source: Because it is an NSView object, you can integrate it into your existing AppKit view hierarchies to implement portions of your UI.
ja: それがNSViewオブジェクトであることから、あなたはそれをあなたの既存のAppKitビュー階層へと統合することであなたのUIの一部を実装可能です。

source: Because of the architecture and data model of NSXML, when it parses and processes a source of XML it cannot know about your subclass unless you override the XMLDocument class method replacementClass(for:) to return your custom class in place of an NSXML class.
ja: NSXMLのアーキテクチャとデータモデルが原因で、それがXMLのソースを構文解析して処理する時にそれはあなたのサブクラスについて知ることはできません、もしあなたがXMLDocumentのクラスメソッドreplacementClass(for:)をオーバーライドしてあなたのあつらえのクラスをNSXMLクラスの代わりに返すのでなければ。

source: Because of the architecture and data model of NSXML, when it parses and processes a source of XML it cannot know about your subclass unless you override the class method replacementClass(for:) to return your custom class in place of an NSXML class.
ja: NSXMLのアーキテクチャとデータモデルのため、それはXMLのソースを構文解析および処理する時、それはあなたのサブクラスについて知ることはできません、あなたがクラスメソッドreplacementClass(for:)をオーバーライドすることであなたのあつらえのクラスをNSXMLクラスの代わりに返さない限りは。

source: Because of the nature of class clusters, a scanner object isn’t an actual instance of the Scanner class, but is one of its private subclasses.
ja: クラスクラスタの性質ゆえに、スキャナーオブジェクトはScannerクラスの実際のインスタンスではありません、しかしそれのプライベートなサブクラスのうちの１つです。

source: Because the horizontal bounds of TextField never exceed its graphical extent, this value has little to no effect on single-line text.
ja: TextFieldの水平境界が決してそれのグラフィカルな広さを越えないことから、この値は単一行テキスト上で全くと言っていいほど効果を持ちません。

source: Before you run the sample code project in Xcode:
ja: あなたがサンプルコードプロジェクトをXcodeにおいて実行する前に：

source: Begins a new subpath at the specified point.
ja: 新しいサブパスをこの指定された点で開始します。

source: Beyond a certain point in either direction, however, kerning does disable nonessential ligatures.
ja: ある点をどちらかの方向において越えると、しかしながら、カーニングは非本質的なリガチャを無効にします。

source: Bindings also have transactions to pass values between views.
ja: バインディングはまた、値をビューの間で渡すためにトランザクションを持ちます。

source: Bindings offer two-way connections, so that onscreen controls can mutate the state.
ja: バインディングは双方向接続を提案します、それで画面上のコントロールそれらは、状態を変化させられます。

source: Binds a view’s identity to the given proxy value.
ja: ビューのもつ同一性をこの与えられた値とバインドします。

source: Block until the receiver is finished.
ja: レシーバが終了されるまで遮断します。

source: Bold text.
ja: ボールド（太字の）テキスト。

source: Both the x and y multiplication factors halve their respective dimension’s size when set to 0.5, maintain their existing size when set to 1, double their size when set to 2, and so forth.
ja: xとy増倍率の両方とも、0.5に設定される場合めいめいの次元の大きさを半分にします、1に設定される場合それらの既存の大きさを保守します、2に設定される場合それらの大きさを倍にします、などなど。

source: Brightens the view by the specified amount.
ja: ビューをこの指定された量だけ明るくします。

source: Brightens this view by the specified amount.
ja: このビューをこの指定された量だけ明るくします。

source: Building Blocks
ja: ブロックを組み立てる

source: Building Custom Views in SwiftUI
ja: あつらえのビューをSwiftUIにおいて構築する

source: Building Lists and Navigation
ja: リストとナビゲーションを構築する

source: Building Widgets Using WidgetKit and SwiftUI
ja: ウィジェットをWidgetKitおよびSwiftUIを使って構築する

source: Builds an empty view from a block containing no statements.
ja: 空のビューを少しも文を含んでいないブロックから組み立てます。

source: Built-in Scene Types
ja: 組み込みシーン型

source: Button Styles
ja: ボタンスタイル

source: Buttons
ja: ボタン

source: Buttons automatically adapt their visual style to match the expected style within these different containers and contexts.
ja: ボタンは、自動的にそれらの視覚的スタイルを、それら異なるコンテナおよび前後関係の内部でその期待されるスタイルに合わせて変えます。

source: By applying a clipping shape to a view, you preserve the parts of the view covered by the shape, while eliminating other parts of the view.
ja: 切り抜き形状をビューに適用することによって、あなたはその形状によって覆われるビューの部分を保護します、一方でビューの他の部分は排除します。

source: By default NSXMLDocument implements the NSObject isEqual(_:) method to perform a deep comparison: two NSXMLDocument objects are not considered equal unless they have the same name, same child nodes, same attributes, and so on.
ja: 初期状態でNSXMLDocumentはNSObjectのisEqual(_:)メソッドを実装して、ある深い比較を実行します：２つのNSXMLDocumentオブジェクトは等しいとみなされません、それらが同じ名前、同じ子ノード、同じ属性、などを持たない限り。

source: By default XMLNode implements the NSObject isEqual(_:) method to perform a deep comparison: two XMLNode objects are not considered equal unless they have the same name, same child nodes, same attributes, and so on.
ja: 初期状態でXMLNodeはNSObjectのisEqual(_:)メソッドを実装して、ある深い比較を実行します：２つのXMLNodeオブジェクトは等しいとみなされません、それらが同じ名前、同じ子ノード、同じ属性、などを持たない限り。

source: By default, SwiftUI assumes that you don’t want to localize stored strings, but if you do, you can first create a localized string key from the value, and initialize the text view with that.
ja: 初期状態では、SwiftUIは、あなたが格納された文字列をローカライズしたくないと仮定します、しかしあなたがするならば、あなたは最初にローカライズ文字列キーをその値から作成して、そしてテキストビューをそれで初期化できます。

source: By default, a view’s bounding frame is used only for layout, so any content that extends beyond the edges of the frame is still visible.
ja: 初期状態では、ビューのもつ境界枠はレイアウトに対してのみ使われます、それでその枠の縁を越えて広がるあらゆる内容は、依然として可視です。

source: By default, a view’s bounding frame only affects its layout, so any content that extends beyond the edges of the frame remains visible.
ja: 初期状態では、ビューのもつ境界枠はそれのレイアウトに影響するだけです、それでその枠の縁を越えて広がるあらゆる内容は、可視のままです。

source: By default, an Process object inherits its environment from the process that launches it.
ja: 省略時では、Processオブジェクトは、それの環境をそれを起動するプロセスから継承します。

source: By default, the border appears inside the bounds of this view.
ja: 初期状態では、境界線はこのビューの境界の内側に現れます。

source: By drawing a border around each text view, you can see how the text moves, and how that affects the view.
ja: 輪郭線を各テキストビューの周りに描くことによって、あなたはどのようにテキストが移動するか、そしてどのようにそれはビューに影響を与えるかを見ることができます。

source: By expanding the disclosure group, the user can use the toggles to update the state of the toggleStates structure.
ja: 開示グループを展開することによって、ユーザはトグルを使ってtoggleStates構造体の状態を更新できます。

source: By process a standalone (external) DTD
ja: 単独動作型（外部）DTD処理によって。

source: By processing an XML document with its own internal (in-line) DTD
ja: XML書類をそれ自身の内部（インライン）DTDを処理することによって。

source: Calculates and returns the most appropriate size for the current view.
ja: 現在のビューに対して最も適切な大きさを計算して返します。

source: Call body(p), where p is a pointer to the collection’s contiguous storage.
ja: body(p)を呼び出します、ここでpはコレクションのもつ隣接ストレージへのポインタです。

source: Call randomElement() to select a random element from an array or another collection.
ja: randomElement()を呼び出して、ある無作為な要素を配列または別のコレクションから選んでください。

source: Call randomElement(using:) to select a random element from an array or another collection when you are using a custom random number generator.
ja: randomElement(using:)を呼び出して、ある無作為な要素を配列または別のコレクションから選んでください、あなたがあつらえの乱数生成子を使っている場合。
